# Conectando Python e SQL

In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/e7/bd/055a6b0e45bf068317819e8f39699421c6f8621efce62bd609cc6c63d6e6/mysql_connector_python-8.0.17-cp37-cp37m-manylinux1_x86_64.whl (13.1MB)
     |████████████████████████████████| 13.1MB 2.4MB/s eta 0:00:01
Collecting protobuf>=3.0.0 (from mysql-connector-python)
  Downloading https://files.pythonhosted.org/packages/30/fd/60ce148d8e4205bdf6da4ffec31348fd33f710c20a882b44319d54fd51ae/protobuf-3.9.1-cp37-cp37m-manylinux1_x86_64.whl (1.2MB)
     |████████████████████████████████| 1.2MB 4.4MB/s eta 0:00:01
Requirement already satisfied: six>=1.9 in /home/felipe/anaconda3/lib/python3.7/site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in /home/felipe/anaconda3/lib/python3.7/site-packages (from protobuf>=3.0.0->mysql-connector-python) (41.0.1)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.17 protobuf-3.9.1

**Importando módulo**

In [1]:
import mysql.connector

**Conectando com o banco**

In [2]:
#Parametros para o banco de dados
host = 'db4free.net'
database = 'ds1908a'
user = 'datascience'
password = 'programar123'
port = 3306

In [9]:
# conectando
con = mysql.connector.connect(user=user,
                             database=database,
                             host=host,
                             password=password,
                             port=port)

con.close()

*Adicionando dados*

In [11]:
con = mysql.connector.connect(user=user,
                             database=database,
                             host=host,
                             password=password,
                             port=port)
cursor = con.cursor()
sql = 'INSERT INTO Usuarios(nome, idade, sexo, salario) VALUES (%s,%s,%s,%s)'
val = ('Joao', '33', 'F', '550')
cursor.execute(sql, val)

con.commit()
con.close()

*Lendo dados*

In [14]:
con = mysql.connector.connect(user=user,
                             database=database,
                             host=host,
                             password=password,
                             port=port)

cursor = con.cursor()

sql = 'SELECT * FROM Usuarios'

cursor.execute(sql)

resultado = cursor.fetchall()

for linha in resultado:
    print('___________')
    print(linha)
    print('Nome: ', linha[0])
    print('Idade: ', linha[1])
    print('Sexo: ', linha[2])
    print('Salário: ', linha[3])
    
con.close()

___________
('Renato Amorim', '41', 'M', '210')
Nome:  Renato Amorim
Idade:  41
Sexo:  M
Salário:  210
___________
('Henrique Bezerra', '16', 'M', '100')
Nome:  Henrique Bezerra
Idade:  16
Sexo:  M
Salário:  100
___________
('Joana Roa', '37', 'F', '310')
Nome:  Joana Roa
Idade:  37
Sexo:  F
Salário:  310
___________
('Mariana Valquiria', '33', 'F', '550')
Nome:  Mariana Valquiria
Idade:  33
Sexo:  F
Salário:  550
___________
('Mariana Almeida', '33', 'F', '550')
Nome:  Mariana Almeida
Idade:  33
Sexo:  F
Salário:  550
___________
('Mariana', '33', 'F', '550')
Nome:  Mariana
Idade:  33
Sexo:  F
Salário:  550
___________
('Florentina de Jesus', '33', 'F', '550')
Nome:  Florentina de Jesus
Idade:  33
Sexo:  F
Salário:  550
___________
('Joao', '33', 'F', '550')
Nome:  Joao
Idade:  33
Sexo:  F
Salário:  550
___________
('Jorge', '63', 'M', '167')
Nome:  Jorge
Idade:  63
Sexo:  M
Salário:  167

*Deletando dados*

In [15]:
con = mysql.connector.connect(user=user,
                             database=database,
                             host=host,
                             password=password,
                             port=port)

cursor = con.cursor()

sql = 'DELETE FROM Usuarios Where nome="Joao"'
cursor.execute(sql)

con.commit()
    
con.close()

In [3]:
import pandas as pd

con = mysql.connector.connect(user=user,
                             database=database,
                             host=host,
                             password=password,
                             port=port)

df = pd.read_sql_query('SELECT * FROM Usuarios', con)

con.close()

df.head()

                nome idade sexo salario
0   Henrique Bezerra    16    M     100
1          Joana Roa    37    F     310
2  Mariana Valquiria    33    F     550
3    Mariana Almeida    33    F     550
4            Mariana    33    F     550

In [5]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /home/felipe/anaconda3/lib/python3.7/site-packages (1.3.5)

In [7]:
from sqlalchemy import create_engine
import seaborn as sns

In [8]:
df = sns.load_dataset('tips')

In [9]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [10]:
#criando engine
text_engine = 'mysql+mysqlconnector://{}:{}@{}:{}/{}'.format(user,password,host,port,database)
engine = create_engine(text_engine)

#salvando para BD
df.to_sql('Tips-Felipe', con=engine, if_exists='replace')